       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPLEX-NUMBERS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 Z1-RE          PIC S99999.
       01 Z1-IM          PIC S99999.
       01 Z2-RE          PIC S99999.
       01 Z2-IM          PIC S99999. 
       01 RESULT-RE      PIC S99999V9999.
       01 RESULT-IM      PIC S99999V9999.


       PROCEDURE DIVISION.

       C-REAL.


 
       C-IMAGINARY.



       C-ADD.



       C-SUB.



       C-MUL.



       C-DIV.



       C-ABS.



       C-CONJUGATE.


