       IDENTIFICATION DIVISION.
       PROGRAM-ID. reverse-string.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STRING PIC X(64).

       PROCEDURE DIVISION.
       REVERSE-STRING.

STRING* Reverse a string and display result
       
       DISPLAY WS-STRING.
