       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       LEAP.
      * Enter solution here
         CONTINUE.
       LEAP-EXIT.
         EXIT.
