       IDENTIFICATION DIVISION.
       PROGRAM-ID. DARTS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X PIC 9V9.
       01 WS-Y PIC 9V9.
       01 WS-RESULT PIC 99.
       PROCEDURE DIVISION.
       DARTS.
