       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MODULUS-VALUES.
         02 WS-MOD400 PIC 999.
         02 WS-MOD100 PIC 999.
         02 WS-MOD004 PIC 999.
       01 WS-RESULT PIC 9.
       01 WS-YEAR PIC 9999.
       01 WS-TEMP PIC 9999.
       PROCEDURE DIVISION.
       LEAP.
         DIVIDE WS-YEAR BY 400 GIVING WS-TEMP REMAINDER WS-MOD400.
         DIVIDE WS-YEAR BY 100 GIVING WS-TEMP REMAINDER WS-MOD100.
         DIVIDE WS-YEAR BY 4   GIVING WS-TEMP REMAINDER WS-MOD004.
         IF WS-MOD400 = 0 OR (WS-MOD100 <> 0 AND WS-MOD004 = 0)
            MOVE 1 TO WS-RESULT
         ELSE 
            MOVE 0 TO WS-RESULT
         END-IF.
       LEAP-EXIT.
         EXIT.
