       IDENTIFICATION DIVISION.
       PROGRAM-ID. square-root.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER PIC 9(32).
       01 WS-SQRT PIC 9(32).

       PROCEDURE DIVISION.
       SQUARE-ROOT.
       MOVE FUNCTION SQRT(WS-NUMBER) TO WS-SQRT.
       
       DISPLAY WS-SQRT.
