       IDENTIFICATION DIVISION.
       PROGRAM-ID. KNAPSACK.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-INPUTS.
           05 MAXIMUM-WEIGHT    PIC 999.
           05 NO-OF-ITEMS       PIC 99.
           05 KNAPSACKTABLE     OCCURS 1 TO 20 DEPENDING ON NO-OF-ITEMS.
              10 WS-WEIGHT      PIC 999.
              10 WS-VALUE       PIC 999.
       01 WS-OUTPUTS.
           05 WS-RESULT         PIC 99999.

       PROCEDURE DIVISION.
 
       MAXIMUM-VALUE.  