       IDENTIFICATION DIVISION.
       PROGRAM-ID. armstrong-numbers.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY. FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER PIC X(8).
       01 WS-ARMSTRONG PIC 9(8).

       PROCEDURE DIVISION.
       ARMSTRONG-NUMBERS.

