       IDENTIFICATION DIVISION.
       PROGRAM-ID. raindrops.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER PIC 9(4).
       01 WS-RESULT PIC X(20).

       PROCEDURE DIVISION.
       RAINDROPS.

       IF FUNCTION MOD(WS-NUMBER, 3) EQUAL 0
           STRING "Pling" 
           INTO WS-RESULT
       END-IF.

       IF FUNCTION MOD(WS-NUMBER, 5) EQUAL 0
           STRING FUNCTION TRIM(WS-RESULT TRAILING) "Plang" 
           INTO WS-RESULT
       END-IF.

       IF FUNCTION MOD(WS-NUMBER, 7) EQUAL 0
           STRING FUNCTION TRIM(WS-RESULT TRAILING) "Plong" 
           INTO WS-RESULT
       END-IF.

       IF WS-RESULT EQUAL SPACE
           MOVE WS-NUMBER TO WS-RESULT
       END-IF.

       DISPLAY WS-RESULT.
