       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROBOT-SIMULATOR.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X-COORD               PIC S999.
       01 WS-Y-COORD               PIC S999.
       01 WS-DIRECTION             PIC X(20).
       01 WS-INSTRUCTIONS          PIC X(60).
       
       PROCEDURE DIVISION.
       
       CREATE-ROBOT.


       MOVE-ROBOT.