       IDENTIFICATION DIVISION.
       PROGRAM-ID. rna-transcription.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COMPLEMENT PIC X(64).
       01 WS-DNA PIC X(4) VALUE "ACGT".
       01 WS-RNA PIC X(4) VALUE "UGCA".

       PROCEDURE DIVISION.
       RNA-TRANSCRIPTION.

       INSPECT WS-COMPLEMENT CONVERTING WS-DNA
       TO WS-RNA.
       
      *DISPLAY WS-COMPLEMENT.
