       IDENTIFICATION DIVISION.
       PROGRAM-ID. armstrong-numbers.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY. FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER PIC X(8).
       01 WS-DIGIT PIC 9(1).
       01 WS-ARMSTRONG PIC 9(8).
       01 WS-RESULT PIC 9.
       01 WS-INDEX PIC 9(4).

       PROCEDURE DIVISION.
       ARMSTRONG-NUMBERS.
       MOVE 0 TO WS-ARMSTRONG
       PERFORM VARYING WS-INDEX FROM 1 BY 1 
           UNTIL WS-INDEX > LENGTH(TRIM(WS-NUMBER))
           IF WS-NUMBER (WS-INDEX:1) EQUAL 0
               EXIT PERFORM CYCLE
           END-IF
           MOVE WS-NUMBER (WS-INDEX:1) TO WS-DIGIT
           COMPUTE WS-ARMSTRONG = 
               WS-ARMSTRONG + WS-DIGIT ** LENGTH(TRIM(WS-NUMBER))
       END-PERFORM.

       IF FUNCTION NUMVAL ( WS-NUMBER ) IS EQUAL TO WS-ARMSTRONG
           MOVE 1 TO WS-RESULT
       ELSE 
           MOVE 0 TO WS-RESULT

       DISPLAY WS-ARMSTRONG.
       DISPLAY WS-NUMBER.
