       IDENTIFICATION DIVISION.
       PROGRAM-ID. BINARY-SEARCH.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-ITEM                  PIC 9999.
       01 WS-RESULT                PIC 99.
       01 WS-ERROR                 PIC X(40).
       01 WS-COUNT                 PIC 99.       
       01 WS-ARRAY                 PIC X(60).

       PROCEDURE DIVISION.
       
       BINARY-SEARCH. 
