       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROMAN-NUMERALS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ROMAN-REPRESENTATION-PATTERNS.
        03 FILLER PIC XXXX VALUE SPACES.
        03 FILLER PIC XXXX VALUE "a   ".
        03 FILLER PIC XXXX VALUE "aa  ".
        03 FILLER PIC XXXX VALUE "aaa ".
        03 FILLER PIC XXXX VALUE "ab  ".
        03 FILLER PIC XXXX VALUE "b   ".
        03 FILLER PIC XXXX VALUE "ba  ".
        03 FILLER PIC XXXX VALUE "baa ".
        03 FILLER PIC XXXX VALUE "baaa".
        03 FILLER PIC XXXX VALUE "ac  ".
       01 REPRESENTATION-ARRAY REDEFINES ROMAN-REPRESENTATION-PATTERNS.
        03 REPRESENTER PIC XXXX OCCURS 10 TIMES 
           INDEXED BY REPRESENTATION-INDEX.

       01 WS-NUMBER PIC 9999.
       01 WS-NUMBER-COLUMNS REDEFINES WS-NUMBER.
        03 WS-DIGIT PIC 9 OCCURS 4 TIMES.

       01 COLUMN-LETTER-SETS.
        03 FILLER PIC XXX VALUE "Mvx".
        03 FILLER PIC XXX VALUE "CDM".
        03 FILLER PIC XXX VALUE "XLC".
        03 FILLER PIC XXX VALUE "IVX".
       01 COLUMN-LETTER-SET-ARRAY REDEFINES COLUMN-LETTER-SETS.
        03 COLUMN-LETTERS PIC XXX OCCURS 4 TIMES.
          
       01 WS-RESULT PIC X(20).
       01 WS-TEMP PIC X(20).

       01 SELECTED-REPRESENTER PIC XXXX.
       
       01 SELECTED-COLUMN-LETTERS PIC XXX.
       01 SELECTED-COLUMN-CHARACTER-SET 
          REDEFINES SELECTED-COLUMN-LETTERS.
        03 COLUMN-LETTER-CHARACTERS PIC X OCCURS 3 TIMES.

       01 COLUMN-COUNTER PIC 9.
       PROCEDURE DIVISION.
       ROMAN-NUMERALS.
         MOVE SPACES TO WS-TEMP.
         MOVE SPACES TO WS-RESULT.
         MOVE 0 TO COLUMN-COUNTER.
         PERFORM VARYING COLUMN-COUNTER 
           FROM 4 
           BY -1 
           UNTIL COLUMN-COUNTER = 0
           PERFORM MAKE-ROMAN THRU MAKE-ROMAN-EXIT
           STRING SELECTED-REPRESENTER DELIMITED BY SPACE
            WS-RESULT DELIMITED BY SPACE
            INTO WS-TEMP
           MOVE WS-TEMP TO WS-RESULT
         END-PERFORM.
      *  DISPLAY WS-RESULT.
       ROMAN-NUMERALS-EXIT.
         EXIT.
         
       MAKE-ROMAN.
         SET REPRESENTATION-INDEX TO WS-DIGIT(COLUMN-COUNTER).
         SET REPRESENTATION-INDEX UP BY 1.
         MOVE REPRESENTER(REPRESENTATION-INDEX) TO SELECTED-REPRESENTER.
         MOVE COLUMN-LETTERS(COLUMN-COUNTER) TO SELECTED-COLUMN-LETTERS.
         INSPECT SELECTED-REPRESENTER 
           REPLACING ALL "a" BY COLUMN-LETTER-CHARACTERS(1)
                     ALL "b" BY COLUMN-LETTER-CHARACTERS(2)
                     ALL "c" BY COLUMN-LETTER-CHARACTERS(3).
       MAKE-ROMAN-EXIT.
         EXIT.
