       IDENTIFICATION DIVISION.
       PROGRAM-ID. CIRCULAR-BUFFER.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CAPACITY              PIC 999.
       01 WS-ITEM                  PIC 9.
       01 WS-RESULT                PIC 9.
       01 WS-SUCCESS               PIC 9.

       PROCEDURE DIVISION. 
       CREATE-BUFFER.
      

       READ-BUFFER.


       WRITE-BUFFER.


       OVERWRITE-BUFFER.


       CLEAR-BUFFER.
