       IDENTIFICATION DIVISION.
       PROGRAM-ID. SECRET-HANDSHAKE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-INPUT                 PIC 999.
       01 WS-RESULT                PIC X(60).

       PROCEDURE DIVISION.

       COMMANDS. 