       IDENTIFICATION DIVISION.
       PROGRAM-ID. BINARY.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-BINARY                PIC X(60).
       01 WS-RESULT                PIC 9999.
       01 WS-ERROR                 PIC X(60). 
       
       PROCEDURE DIVISION.
       
       DECIMAL.
 