       IDENTIFICATION DIVISION.
       PROGRAM-ID. difference-of-squares.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DIFFERENCE-OF-SQUARES PIC 9(8).
       01 WS-SUM-OF-SQUARES PIC 9(8).
       01 WS-SQUARE-OF-SUM PIC 9(8).
       01 WS-NUMBER PIC 9(8).

       PROCEDURE DIVISION.
       
       SQUARE-OF-SUM.

       
       SUM-OF-SQUARES.

       
       DIFFERENCE-OF-SQUARES.


