       IDENTIFICATION DIVISION.
       PROGRAM-ID. MEETUP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-YEAR                  PIC 9999.
       01 WS-MONTH                 PIC 99.
       01 WS-WEEK                  PIC X(10).
       01 WS-DAYOFWEEK             PIC X(10).
       01 WS-RESULT                PIC X(40).

       PROCEDURE DIVISION. 

       MEETUP.