       IDENTIFICATION DIVISION.
       PROGRAM-ID. ANAGRAM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SUBJECT PIC X(20).
       01 WS-CANDIDATES-COUNT PIC 9.
       01 WS-CANDIDATES-TABLE.
           02 WS-CANDIDATES OCCURS 1 TO 20
                            DEPENDING ON WS-CANDIDATES-COUNT.
              05 WS-CANDIDATE PIC X(20).
       01 WS-RESULT-LIST PIC X(48).

       PROCEDURE DIVISION.

       FIND-ANAGRAMS.
