        IDENTIFICATION DIVISION.
        PROGRAM-ID. ISOGRAM.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-PHRASE PIC X(60).
        01 WS-RESULT PIC 99.
        PROCEDURE DIVISION.
        ISOGRAM.
