       IDENTIFICATION DIVISION.
       PROGRAM-ID. allergies.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SCORE       PIC 999.
       01 WS-ITEM        PIC X(12).
       01 WS-RESULT      PIC A.
       01 WS-RESULT-LIST PIC X(108).

       PROCEDURE DIVISION.
       ALLERGIC-TO.
      * Code this paragraph
           CONTINUE.

       LIST-ALLERGENS.
      * Code this paragraph
           CONTINUE.
